app/controllers/articles_controller.rb

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
---
	def destroy
		@article = Article.destroy(params[:id])